Revit 2024 API
BuiltInFailures.OverlapFailures.ToposolidFloorOverlap Property
 Highlighted toposolid and floor overlap.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ToposolidFloorOverlap { get; }
Visual Basic
Public Shared ReadOnly Property ToposolidFloorOverlap As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ToposolidFloorOverlap {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.OverlapFailures Class
Autodesk.Revit.DB Namespace